Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/include/proc/p32mz2064dal176.h
#define _GLCDCURDATA64_PIXEL167_POSITION         0x00000000
#define _GLCDCURDATA64_PIXEL167_MASK             0x0000000F
#define _GLCDCURDATA64_PIXEL167_LENGTH           0x00000004

#define _GLCDCURDATA64_PIXEL166_POSITION         0x00000004
#define _GLCDCURDATA64_PIXEL166_MASK             0x000000F0
#define _GLCDCURDATA64_PIXEL166_LENGTH           0x00000004

#define _GLCDCURDATA64_PIXEL165_POSITION         0x00000008
#define _GLCDCURDATA64_PIXEL165_MASK             0x00000F00
#define _GLCDCURDATA64_PIXEL165_LENGTH           0x00000004

#define _GLCDCURDATA64_PIXEL164_POSITION         0x0000000C
#define _GLCDCURDATA64_PIXEL164_MASK             0x0000F000
#define _GLCDCURDATA64_PIXEL164_LENGTH           0x00000004

#define _GLCDCURDATA64_PIXEL163_POSITION         0x00000010
#define _GLCDCURDATA64_PIXEL163_MASK             0x000F0000
#define _GLCDCURDATA64_PIXEL163_LENGTH           0x00000004

#define _GLCDCURDATA64_PIXEL162_POSITION         0x00000014
#define _GLCDCURDATA64_PIXEL162_MASK             0x00F00000
#define _GLCDCURDATA64_PIXEL162_LENGTH           0x00000004

#define _GLCDCURDATA64_PIXEL161_POSITION         0x00000018
#define _GLCDCURDATA64_PIXEL161_MASK             0x0F000000
#define _GLCDCURDATA64_PIXEL161_LENGTH           0x00000004

#define _GLCDCURDATA64_PIXEL160_POSITION         0x0000001C
#define _GLCDCURDATA64_PIXEL160_MASK             0xF0000000
#define _GLCDCURDATA64_PIXEL160_LENGTH           0x00000004

#define _GLCDCURDATA65_PIXEL1615_POSITION        0x00000000
#define _GLCDCURDATA65_PIXEL1615_MASK            0x0000000F
#define _GLCDCURDATA65_PIXEL1615_LENGTH          0x00000004

#define _GLCDCURDATA65_PIXEL1614_POSITION        0x00000004
#define _GLCDCURDATA65_PIXEL1614_MASK            0x000000F0
#define _GLCDCURDATA65_PIXEL1614_LENGTH          0x00000004

#define _GLCDCURDATA65_PIXEL1613_POSITION        0x00000008
#define _GLCDCURDATA65_PIXEL1613_MASK            0x00000F00
#define _GLCDCURDATA65_PIXEL1613_LENGTH          0x00000004

#define _GLCDCURDATA65_PIXEL1612_POSITION        0x0000000C
#define _GLCDCURDATA65_PIXEL1612_MASK            0x0000F000
#define _GLCDCURDATA65_PIXEL1612_LENGTH          0x00000004

#define _GLCDCURDATA65_PIXEL1611_POSITION        0x00000010
#define _GLCDCURDATA65_PIXEL1611_MASK            0x000F0000
#define _GLCDCURDATA65_PIXEL1611_LENGTH          0x00000004

#define _GLCDCURDATA65_PIXEL1610_POSITION        0x00000014
#define _GLCDCURDATA65_PIXEL1610_MASK            0x00F00000
#define _GLCDCURDATA65_PIXEL1610_LENGTH          0x00000004

#define _GLCDCURDATA65_PIXEL169_POSITION         0x00000018
#define _GLCDCURDATA65_PIXEL169_MASK             0x0F000000
#define _GLCDCURDATA65_PIXEL169_LENGTH           0x00000004

#define _GLCDCURDATA65_PIXEL168_POSITION         0x0000001C
#define _GLCDCURDATA65_PIXEL168_MASK             0xF0000000
#define _GLCDCURDATA65_PIXEL168_LENGTH           0x00000004

#define _GLCDCURDATA66_PIXEL1623_POSITION        0x00000000
#define _GLCDCURDATA66_PIXEL1623_MASK            0x0000000F
#define _GLCDCURDATA66_PIXEL1623_LENGTH          0x00000004

#define _GLCDCURDATA66_PIXEL1622_POSITION        0x00000004
#define _GLCDCURDATA66_PIXEL1622_MASK            0x000000F0
#define _GLCDCURDATA66_PIXEL1622_LENGTH          0x00000004

#define _GLCDCURDATA66_PIXEL1621_POSITION        0x00000008
#define _GLCDCURDATA66_PIXEL1621_MASK            0x00000F00
#define _GLCDCURDATA66_PIXEL1621_LENGTH          0x00000004

#define _GLCDCURDATA66_PIXEL1620_POSITION        0x0000000C
#define _GLCDCURDATA66_PIXEL1620_MASK            0x0000F000
#define _GLCDCURDATA66_PIXEL1620_LENGTH          0x00000004

#define _GLCDCURDATA66_PIXEL1619_POSITION        0x00000010
#define _GLCDCURDATA66_PIXEL1619_MASK            0x000F0000
#define _GLCDCURDATA66_PIXEL1619_LENGTH          0x00000004

#define _GLCDCURDATA66_PIXEL1618_POSITION        0x00000014
#define _GLCDCURDATA66_PIXEL1618_MASK            0x00F00000
#define _GLCDCURDATA66_PIXEL1618_LENGTH          0x00000004

#define _GLCDCURDATA66_PIXEL1617_POSITION        0x00000018
#define _GLCDCURDATA66_PIXEL1617_MASK            0x0F000000
#define _GLCDCURDATA66_PIXEL1617_LENGTH          0x00000004

#define _GLCDCURDATA66_PIXEL1616_POSITION        0x0000001C
#define _GLCDCURDATA66_PIXEL1616_MASK            0xF0000000
#define _GLCDCURDATA66_PIXEL1616_LENGTH          0x00000004

#define _GLCDCURDATA67_PIXEL1631_POSITION        0x00000000
#define _GLCDCURDATA67_PIXEL1631_MASK            0x0000000F
#define _GLCDCURDATA67_PIXEL1631_LENGTH          0x00000004

#define _GLCDCURDATA67_PIXEL1630_POSITION        0x00000004
#define _GLCDCURDATA67_PIXEL1630_MASK            0x000000F0
#define _GLCDCURDATA67_PIXEL1630_LENGTH          0x00000004

#define _GLCDCURDATA67_PIXEL1629_POSITION        0x00000008
#define _GLCDCURDATA67_PIXEL1629_MASK            0x00000F00
#define _GLCDCURDATA67_PIXEL1629_LENGTH          0x00000004

#define _GLCDCURDATA67_PIXEL1628_POSITION        0x0000000C
#define _GLCDCURDATA67_PIXEL1628_MASK            0x0000F000
#define _GLCDCURDATA67_PIXEL1628_LENGTH          0x00000004

#define _GLCDCURDATA67_PIXEL1627_POSITION        0x00000010
#define _GLCDCURDATA67_PIXEL1627_MASK            0x000F0000
#define _GLCDCURDATA67_PIXEL1627_LENGTH          0x00000004

#define _GLCDCURDATA67_PIXEL1626_POSITION        0x00000014
#define _GLCDCURDATA67_PIXEL1626_MASK            0x00F00000
#define _GLCDCURDATA67_PIXEL1626_LENGTH          0x00000004

#define _GLCDCURDATA67_PIXEL1625_POSITION        0x00000018
#define _GLCDCURDATA67_PIXEL1625_MASK            0x0F000000
#define _GLCDCURDATA67_PIXEL1625_LENGTH          0x00000004

#define _GLCDCURDATA67_PIXEL1624_POSITION        0x0000001C
#define _GLCDCURDATA67_PIXEL1624_MASK            0xF0000000
#define _GLCDCURDATA67_PIXEL1624_LENGTH          0x00000004

#define _GLCDCURDATA68_PIXEL177_POSITION         0x00000000
#define _GLCDCURDATA68_PIXEL177_MASK             0x0000000F
#define _GLCDCURDATA68_PIXEL177_LENGTH           0x00000004

#define _GLCDCURDATA68_PIXEL176_POSITION         0x00000004
#define _GLCDCURDATA68_PIXEL176_MASK             0x000000F0
#define _GLCDCURDATA68_PIXEL176_LENGTH           0x00000004

#define _GLCDCURDATA68_PIXEL175_POSITION         0x00000008
#define _GLCDCURDATA68_PIXEL175_MASK             0x00000F00
#define _GLCDCURDATA68_PIXEL175_LENGTH           0x00000004

#define _GLCDCURDATA68_PIXEL174_POSITION         0x0000000C
#define _GLCDCURDATA68_PIXEL174_MASK             0x0000F000
#define _GLCDCURDATA68_PIXEL174_LENGTH           0x00000004

#define _GLCDCURDATA68_PIXEL173_POSITION         0x00000010
#define _GLCDCURDATA68_PIXEL173_MASK             0x000F0000
#define _GLCDCURDATA68_PIXEL173_LENGTH           0x00000004

