Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/include/proc/p32mz2064dal176.h
#define _USBIENCSR0_CLRDT_POSITION               0x00000016
#define _USBIENCSR0_CLRDT_MASK                   0x00400000
#define _USBIENCSR0_CLRDT_LENGTH                 0x00000001

#define _USBIENCSR0_NAKTMOUT_POSITION            0x00000017
#define _USBIENCSR0_NAKTMOUT_MASK                0x00800000
#define _USBIENCSR0_NAKTMOUT_LENGTH              0x00000001

#define _USBIENCSR0_DATATGGL_POSITION            0x00000018
#define _USBIENCSR0_DATATGGL_MASK                0x01000000
#define _USBIENCSR0_DATATGGL_LENGTH              0x00000001

#define _USBIENCSR0_DTWREN_POSITION              0x00000019
#define _USBIENCSR0_DTWREN_MASK                  0x02000000
#define _USBIENCSR0_DTWREN_LENGTH                0x00000001

#define _USBIENCSR0_DMAREQMD_POSITION            0x0000001A
#define _USBIENCSR0_DMAREQMD_MASK                0x04000000
#define _USBIENCSR0_DMAREQMD_LENGTH              0x00000001

#define _USBIENCSR0_FRCDATTG_POSITION            0x0000001B
#define _USBIENCSR0_FRCDATTG_MASK                0x08000000
#define _USBIENCSR0_FRCDATTG_LENGTH              0x00000001

#define _USBIENCSR0_DMAREQEN_POSITION            0x0000001C
#define _USBIENCSR0_DMAREQEN_MASK                0x10000000
#define _USBIENCSR0_DMAREQEN_LENGTH              0x00000001

#define _USBIENCSR0_MODE_POSITION                0x0000001D
#define _USBIENCSR0_MODE_MASK                    0x20000000
#define _USBIENCSR0_MODE_LENGTH                  0x00000001

#define _USBIENCSR0_AUTOSET_POSITION             0x0000001F
#define _USBIENCSR0_AUTOSET_MASK                 0x80000000
#define _USBIENCSR0_AUTOSET_LENGTH               0x00000001

#define _USBIENCSR0_UNDERRUN_POSITION            0x00000012
#define _USBIENCSR0_UNDERRUN_MASK                0x00040000
#define _USBIENCSR0_UNDERRUN_LENGTH              0x00000001

#define _USBIENCSR0_SENDSTALL_POSITION           0x00000014
#define _USBIENCSR0_SENDSTALL_MASK               0x00100000
#define _USBIENCSR0_SENDSTALL_LENGTH             0x00000001

#define _USBIENCSR0_SENTSTALL_POSITION           0x00000015
#define _USBIENCSR0_SENTSTALL_MASK               0x00200000
#define _USBIENCSR0_SENTSTALL_LENGTH             0x00000001

#define _USBIENCSR0_INCOMPTX_POSITION            0x00000017
#define _USBIENCSR0_INCOMPTX_MASK                0x00800000
#define _USBIENCSR0_INCOMPTX_LENGTH              0x00000001

#define _USBIENCSR0_ISO_POSITION                 0x0000001E
#define _USBIENCSR0_ISO_MASK                     0x40000000
#define _USBIENCSR0_ISO_LENGTH                   0x00000001

#define _USBIE0CSR2_RXCNT_POSITION               0x00000000
#define _USBIE0CSR2_RXCNT_MASK                   0x0000007F
#define _USBIE0CSR2_RXCNT_LENGTH                 0x00000007

#define _USBIE0CSR2_SPEED_POSITION               0x00000016
#define _USBIE0CSR2_SPEED_MASK                   0x00C00000
#define _USBIE0CSR2_SPEED_LENGTH                 0x00000002

#define _USBIE0CSR2_NAKLIM_POSITION              0x00000018
#define _USBIE0CSR2_NAKLIM_MASK                  0x0F000000
#define _USBIE0CSR2_NAKLIM_LENGTH                0x00000004

#define _USBIENCSR2_RXCNT_POSITION               0x00000000
#define _USBIENCSR2_RXCNT_MASK                   0x00003FFF
#define _USBIENCSR2_RXCNT_LENGTH                 0x0000000E

#define _USBIENCSR2_TEP_POSITION                 0x00000010
#define _USBIENCSR2_TEP_MASK                     0x000F0000
#define _USBIENCSR2_TEP_LENGTH                   0x00000004

#define _USBIENCSR2_PROTOCOL_POSITION            0x00000014
#define _USBIENCSR2_PROTOCOL_MASK                0x00300000
#define _USBIENCSR2_PROTOCOL_LENGTH              0x00000002

#define _USBIENCSR2_SPEED_POSITION               0x00000016
#define _USBIENCSR2_SPEED_MASK                   0x00C00000
#define _USBIENCSR2_SPEED_LENGTH                 0x00000002

#define _USBIENCSR2_TXINTERV_POSITION            0x00000018
#define _USBIENCSR2_TXINTERV_MASK                0xFF000000
#define _USBIENCSR2_TXINTERV_LENGTH              0x00000008

#define _USBIE0CSR3_UTMIDWID_POSITION            0x00000018
#define _USBIE0CSR3_UTMIDWID_MASK                0x01000000
#define _USBIE0CSR3_UTMIDWID_LENGTH              0x00000001

#define _USBIE0CSR3_SOFTCONE_POSITION            0x00000019
#define _USBIE0CSR3_SOFTCONE_MASK                0x02000000
#define _USBIE0CSR3_SOFTCONE_LENGTH              0x00000001

#define _USBIE0CSR3_DYNFIFOS_POSITION            0x0000001A
#define _USBIE0CSR3_DYNFIFOS_MASK                0x04000000
#define _USBIE0CSR3_DYNFIFOS_LENGTH              0x00000001

#define _USBIE0CSR3_HBTXEN_POSITION              0x0000001B
#define _USBIE0CSR3_HBTXEN_MASK                  0x08000000
#define _USBIE0CSR3_HBTXEN_LENGTH                0x00000001

#define _USBIE0CSR3_HBRXEN_POSITION              0x0000001C
#define _USBIE0CSR3_HBRXEN_MASK                  0x10000000
#define _USBIE0CSR3_HBRXEN_LENGTH                0x00000001

#define _USBIE0CSR3_BIGEND_POSITION              0x0000001D
#define _USBIE0CSR3_BIGEND_MASK                  0x20000000
#define _USBIE0CSR3_BIGEND_LENGTH                0x00000001

#define _USBIE0CSR3_MPTXEN_POSITION              0x0000001E
#define _USBIE0CSR3_MPTXEN_MASK                  0x40000000
#define _USBIE0CSR3_MPTXEN_LENGTH                0x00000001

#define _USBIE0CSR3_MPRXEN_POSITION              0x0000001F
#define _USBIE0CSR3_MPRXEN_MASK                  0x80000000
#define _USBIE0CSR3_MPRXEN_LENGTH                0x00000001

#define _USBIENCSR3_TEP_POSITION                 0x00000000
#define _USBIENCSR3_TEP_MASK                     0x0000000F
#define _USBIENCSR3_TEP_LENGTH                   0x00000004

#define _USBIENCSR3_PROTOCOL_POSITION            0x00000004
#define _USBIENCSR3_PROTOCOL_MASK                0x00000030
#define _USBIENCSR3_PROTOCOL_LENGTH              0x00000002

#define _USBIENCSR3_SPEED_POSITION               0x00000006
#define _USBIENCSR3_SPEED_MASK                   0x000000C0
#define _USBIENCSR3_SPEED_LENGTH                 0x00000002

#define _USBIENCSR3_RXINTERV_POSITION            0x00000008
#define _USBIENCSR3_RXINTERV_MASK                0x0000FF00
#define _USBIENCSR3_RXINTERV_LENGTH              0x00000008

